server/app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
  def index
    ingredients = Ingredient.all

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    ingredient = Ingredient.find(params[:id])