server/app/controllers/recipes_controller.rb

	def show
		recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

	def create
		recipe = Recipe.create!(recipe_params)
---
INSERT INTO "recipes" ("name", "instructions", "time_required", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

	def update
		recipe = Recipe.find(params[:id])
		recipe.update!(recipe_params)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "recipes" SET "name" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["name", "watlemon"], ["updated_at", "2018-03-15 19:44:00.912369"], ["id", 9]]

	def destroy
		recipe = Recipe.find(params[:id])
		recipe.destroy!
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 4]]