server/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    username = params[:username]
    password = params[:password]

    new_user = User.create!({
      password: password,
      username: username
    })

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "123user"], ["LIMIT", 1]]
---
  def login
    username = params[:username]
    password = params[:password]

    user = User.find_from_credentials username, password